export default function(featureAuthStr = "", commonAuthStr = "") {
  let featureAuths =
    featureAuthStr === undefined ? [] : featureAuthStr.split(",");
  featureAuths = featureAuths.map(function(item) {
    return parseInt(item);
  });
  let commonAuths = commonAuthStr === undefined ? [] : commonAuthStr.split(",");
  commonAuths = commonAuths.map(function(item) {
    return parseInt(item);
  });
  let AUTHS = {
    READ: 10,
    REGISTER: 11, // { value: 11, label: '登録'},
    REGISTER_OLD: 12, // { value: 12, label: '登録(過去)'},
    REGISTER_PROXY: 13, // { value: 13, label: '代理登録'},
    REGISTER_PROXY_OLD: 14, // { value: 14, label: '代理登録(過去)'},
    DONE_OREDER: 15, // { value: 15, label: '実施'},
    EDIT: 21, // { value: 21, label: '変更'},
    EDIT_OLD: 22, // { value: 22, label: '変更(過去)'},
    EDIT_PROXY: 23, // { value: 23, label: '代理変更'},
    EDIT_PROXY_OLD: 24, // { value: 24, label: '代理変更(過去)'},
    EDIT_ORDER_STATE: 25, // { value: 25, label: 'オーダー状態編集'},
    STOP: 31, // { value: 31, label: '中止'},
    STOP_OLD: 32, // { value: 32, label: '中止(過去)'},
    STOP_PROXY: 33, // { value: 33, label: '代理中止'},
    STOP_PROXY_OLD: 34, // { value: 34, label: '代理中止(過去)'},
    DELETE_INJECTION_NOT_DONE: 35, // { value: 35, label: '未実施の依頼を削除'},
    DELETE_INJECTION_DONE: 36, // { value: 36, label: '実施済の依頼を削除'},
    INJECTION_DONE_TO_NOT_DONE: 37, // { value: 37, label: '実施済を未実施に戻す'},    
    DELETE: 41, // { value: 41, label: '削除'},
    DELETE_OLD: 42, // { value: 42, label: '削除(過去)'},
    DELETE_PROXY: 43, // { value: 43, label: '代理削除'},
    DELETE_PROXY_OLD: 44, // { value: 44, label: '代理削除(過去)'},
    DELETE_TODAY_NOT_ACCEPT: 45, // { value: 45, label: '当日未受付の削除'},
    DELETE_TODAY_NOT_ACCEPT_PROXY: 46, // { value: 46, label: '当日未受付の削除'},
    DELETE_TODAY_DONE: 47, // { value: 47, label: '当日実施済みの削除'},
    DELETE_TODAY_DONE_PROXY: 48, // { value: 48, label: '当日実施済みの削除（代理）'},
    DELETE_PAST_DONE: 49, // { value: 49, label: '過去実施済みの削除'},
    DELETE_PAST_DONE_PROXY: 50, // { value: 50, label: '過去実施済みの削除（代理）'},
    CONFIRM: 51, // { value: 51, label: '承認'},
    SHOW_DELETE: 52, // { value: 51, label: '削除済みの表示'},
    CAN_SHOW: 53, // { value: 53, label: '薬剤マスタ管理画面の閲覧'},
    // RECEIPT: 61, // {value: 61, label: 'レセプト情報の修正'},
    RECEIPT: 61, // {value: 61, label: '診療科修正(過去)'},
    RECEIPT_CURRENT: 62, // {value: 62, label: '診療科修正(当日)'},
    KARTE_STATUS_PAST: 63, // {value: 63, label: '入外区分修正(過去)'},
    KARTE_STATUS_CURRENT: 64, // {value: 64, label: '入外区分修正(当日)'},
    MEAL_IMPLEMENT_EDIT: 65, // {value: 65, label: '実施直前変更'},

    S:80,    //S
    O:81,    //O
    A:82,    //A
    P:83,    //P
    INSTRUCTION:84,        //指示
    CURRENT_DISEASE:85,    //現症
    REG_PRESCRIPTION:86,   //定期処方
    TEMP_PRESCRIPTION:87,  //臨時処方
    REG_INJECTION:88,      //定期注射
    TEMP_INJECTION:89,     //臨時注射
    TEMP_INSPECTION:90     //臨時検査
  };
  let FEATURES = {
    PRESCRIPTION: 1001, // 処方(注射)
    DISEASE: 1002, // 病名
    PRESET: 1003, // セット処方
    SOAP: 1008, // SOAP
    PERSONAL:1009,
    PERIOD_INJECTION:1010, // 定期注射(定期注射に関わる削除の権限)
    MEDMASTER: 9001, // 薬剤マスタ管理
    EXAMORDER: 1016, // 検査オーダー
    ENDOSCOPEORDER: 1019, // 内視鏡
    TREATORDER: 1017, // 処置
    GUIDANCEORDER: 1018, // 汎用オーダー
    RADIATION: 1020, // 放射線
    REHABILY: 1021, // リハビリ
    VISIT_SCHEDULE: 1022, // 訪問診療スケジュール
    RESERVATION_SCHEDULE: 1023, // 予約カレンダー
    VITAL: 1024, // バイタル
    KARTE: 1025, // カルテ
    PRESETEXAM: 2016, // 検査セット
    DIAL_SYSTEM: 3001, //'透析支援'
    MAINTENANCE: 8000, // メンテナンスタブ
    SYSTEM_SETTING: 8001, //システム設定管理
    MASTER_SETTING: 9100, // 'マスタ設定',
    NOTIFICATION: 9901,//'お知らせ管理',
    PRESET_DO_PRESCRIPTION: 1026,//'セット処方(患者Do)管理',
    PRESET_PATIENT_PRESCRIPTION: 1027,//'セット処方(患者別)管理'=>「患者別セットとして登録」,
    PATIENT_MANAGE: 1028,//'透析患者マスタ
    PASSWORD:9902,  // パスワード
    MyCalendar:9903,  // パスワード
    COURSE_SETTING:9999,   //経過記録項目設定
    HOSPITAL_APPLY:1029,    //入院申込
    HOSPITAL_DECISION:1030, //入院決定
    HOSPITAL_DONE:1031,     //入院実施
    HOSPITAL_INSTRUCTION: 1053, // 入院時指示
    MOVE_WARD:1032,         // 転棟・転室
    CHANGE_RESPONSIBILITY:1033,  //担当変更
    OUT_RETURN:1034,        // 外泊/帰院
    DISCHARGE_PERMISSION:1035,  //退院許可
    DISCHARGE_DECISION:1036,  // 退院決定
    DISCHARGE_DONE:1037,  // 退院実施
    SET_REGISTER: 1038, // セット登録
    SET_CREATE: 1039, // セット作成
    SET_DEPLOY: 1040, // セット展開
    NUTRITION_GUIDANCE: 1041, // 栄養指導依頼
    MEDICINE_GUIDANCE: 1042, // 服薬指導依頼
    DOCUMENT_CREATE: 1043, // 文書作成
    DOCUMENT_REFERENCE: 1044, // 文書参照
    DISCHARGE_DELETE: 1045, // 退院時削除
    MEAL_CHANGE: 1046, // 食事
    WARD_MAP_BED_BACKGROUND: 1047, // 病棟マップ病床背景
    DEATH_REGISTER: 1048, // 死亡情報
    USER_WORD_REGISTER: 7026, // 利用者単語
    HOSPITAL_NURSE_SUMMARY: 1049, // 入院看護サマリー
    VISIT_NURSE_SUMMARY: 1050, // 訪問看護サマリー
    ANAMNE: 1051, // アナムネ
    NURSE_DATABASE: 1052, // 看護データベース
    NURSE_RECORD: 1054, // 看護記録
    // 透析
    DIAL_FACILITY_MASTER:7001,  //'機関マスタ',
    DIAL_BED_MASTER:7002,  //'ベッドマスタ',
    DIAL_CODE_MASTER:7003,  //'コード設定',
    DIAL_MATERIAL_MASTER:7004,  //'資材マスタ',
    DIAL_INSPECTION_MASTER:7005,  //'定期検査マスタ',
    DIAL_MEDICINE_MASTER:7006,  //'薬剤マスタ',
    DIAL_USAGE_GROUP_MASTER:7007,  //'服用グループマスタ',
    DIAL_USAGE_MASTER:7008,  //'服用マスタ',
    DIAL_INJECTION_MASTER:7009,  //'注射マスタ',
    DIAL_MEDICINES_MASTER:7010,  //'医薬品マスタ',
    DIAL_INSPECTION_ITEM_MASTER:7011,  //'検査項目マスタ',
    DIAL_INSPECTION_PATTERN:7012,  //'検査項目パターン',
    DIAL_COMPLIATION_INSPECTION:7013,  //'合併症検査のパターン',
    DIAL_DISEASE_MASTER:7014,  //'病名マスタ',
    DIAL_ADMINFEE_MASTER:7015,  //'管理料マスタ',
    DIAL_HOLIDAY_MASTER:7016,  //'祝日マスタ',
    DIAL_OTHER_FACILITY_MASTER:7017,  //'他施設マスタ',
    DIAL_PRES_SET_MASTER:7018,  //'処方セットマスタ',
    DIAL_INJECTION_SET_MASTER:7019,  //'注射セットマスタ',
    DIAL_CLINICAL_MASTER:7020,  //'日本臨床検査マスタ更新',
    DIAL_STAFF_MASTER:7021,  //'スタッフ設定',
    DIAL_WORD_MASTER:7022,  //'単語設定',
    DIAL_DRKARTE:7023,  //'単語設定',
    DIAL_IMAGE_GENRE_MASTER:7024,  //'画像ジャンルマスタ',
    FOOT_CARE_BASIC_INFORMATION_SETTING:7025,  //'フットケア基本情報設定',
  };

  let FEATURES_NAMES = {
    1001:'処方(注射)',
    1002:'病名',
    1003:'セット処方管理',
    1004:'セット処方(所属科)管理',
    1005:'セット処方(全体共有)管理',
    1026:'セット処方(患者Do)管理',
    1027:'セット処方(患者別)管理',
    1028:'透析患者マスタ',
    1006:'検査結果',
    1007:'外注検査',
    1008:'SOAP',
    1009:'個人設定',
    1010:'定期注射',
    1016:'検査オーダー',
    1017:'処置',
    1018:'汎用オーダー',
    1019:'内視鏡',
    1020:'放射線',
    1021:'リハビリ',
    1022:'訪問診療スケジュール',
    1023:'予約カレンダー',
    1024:'バイタル',
    1025:'カルテ',
    2016:'検査セット管理',
    3001:'透析支援',
    8000:'メンテナンスタブ',
    8001:'システム設定管理',
    9001:'薬剤マスタ',
    9002:'検査マスタ',
    9100:'マスタ設定',
    9901:'お知らせ管理',
    9902:'パスワード',
    9903:'カレンダー',
    1029: '入院申込',
    1030: '入院決定',
    1031:'入院実施',
    1053:'入院時指示',
    1032: '転棟・転室',
    1033:'担当変更',
    1034: '外泊/帰院',
    1035:'退院許可',
    1036: '退院決定',
    1037: '退院実施',
    1038: 'セット登録',
    1039: 'セット作成',
    1040: 'セット展開',
    1041: '栄養指導依頼',
    1042: '服薬指導依頼',
    1043: '文書作成',
    1044: '文書参照',
    1045: '退院時削除',
    1046: '食事',
    1047: '病棟マップ病床背景',
    1048: '死亡情報',
    1049: '入院看護サマリー',
    1050: '訪問看護サマリー',
    1051: 'アナムネ',
    1052: '看護データベース',
    1054: '看護記録',
    7026: '利用者単語',
    // 透析
    9999:'経過記録項目設定',
    7001:'機関マスタ',
    7002:'ベッドマスタ',
    7003:'コード設定',
    7004:'資材マスタ',
    7005:'定期検査マスタ',
    7006:'薬剤マスタ',
    7007:'服用グループマスタ',
    7008:'服用マスタ',
    7009:'注射マスタ',
    7010:'医薬品マスタ',
    7011:'検査項目マスタ',
    7012:'検査項目パターン',
    7013:'合併症検査のパターン',
    7014:'病名マスタ',
    7015:'管理料マスタ',
    7016:'祝日マスタ',
    7017:'他施設マスタ',
    7018:'処方セットマスタ',
    7019:'注射セットマスタ',
    7020:'日本臨床検査マスタ更新',
    7021:'スタッフ設定',
    7022:'単語設定',
    7023:'Drカルテ',
    7024:'画像ジャンルマスタ',
    7025:'フットケア基本情報設定'
  };

  let AUTHS_NAMES = {
    10:'閲覧', // 通常は閲覧可なので、閲覧自体を制限するページだけFEATURES_AUTHS_MAPに設定
    11:'登録',
    12:'登録(過去)',
    13:'代理登録',
    14:'代理登録(過去)',
    15:'オーダー実施',
    21:'変更',
    22:'変更(過去)',
    23:'代理変更',
    24:'代理変更(過去)',
    25:'オーダー状態編集',
    31:'中止',
    32:'中止(過去)',
    33:'代理中止',
    34:'代理中止(過去)',
    35:'未実施の依頼を削除',
    36:'実施済の依頼を削除',
    37:'実施済を未実施に戻す', 
    41:'削除',
    42:'削除(過去)',
    43:'代理削除',
    44:'代理削除(過去)',
    45:'当日未受付の削除',
    46:'当日未受付の削除（代理）',
    47:'当日実施済みの削除',
    48:'当日実施済みの削除（代理）',
    49:'過去実施済みの削除',
    50:'過去実施済みの削除（代理）',
    51:'承認',
    52:'削除済みの表示',
    53:'一覧閲覧', // 特殊な一覧ページがある場合
    // 61:'レセプト情報修正', // 医事課用メニューの制御
    61:'診療科修正(過去)', // 診療科修正(過去)
    62:'診療科修正(当日)', // 診療科修正(当日)
    63:'入外区分修正(過去)', // 入外区分修正(過去)
    64:'入外区分修正(当日)', // 入外区分修正(当日)
    65:'実施直前変更', // 実施直前変更

    80:'S',
    81:'O',
    82:'A',
    83:'P',
    84:'指示',
    85:'現症',
    86:'定期処方',
    87:'臨時処方',
    88:'定期注射',
    89:'臨時注射',
    90:'臨時検査'
  };

  let FEATURES_AUTHS_MAP = {
    1001 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 31, 32, 33, 34, 45, 46, 47, 48, 49, 50, 51, 52, 53, 61, 62, 63, 64],
    1002:  [11, 12, 13, 14, 21, 22, 23 ,24, 31, 32, 33, 34, 41, 42, 43, 44, 51, 52],
    // セット処方管理：登録・変更・削除・一覧閲覧
    1003 : [11, 21, 41],
    1004 : [11, 21, 41, 53],
    1005 : [11, 21, 41, 53],
    1026 : [11],
    1027 : [11, 21, 41],
    1028 : [10, 11, 21, 41],
    // 検査結果 一括登録・ページ閲覧
    1006 : [53],
    // 外注検査登録ページ
    1007 : [11,53],
    // SOAPカルテページ
    1008 : [11, 12, 13, 14, 21, 22, 23 ,24, 41, 42, 43, 44, 51, 52, 61, 62, 63, 64],
    // 個人設定・変更
    1009 : [21],
    // 定期注射に関わる削除の権限
    1010 : [35, 36, 37],
    // 検査オーダー
    1016 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 25, 31, 32, 33, 34, 45, 46, 47, 48, 49, 50, 51, 52, 53, 61, 62, 63, 64],
    // 内視鏡
    1019 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 25, 31, 32, 33, 34, 45, 46, 47, 48, 49, 50, 51, 52, 61, 62, 63, 64],
    // 処置
    1017 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 31, 32, 33, 34, 45, 46, 47, 48, 49, 50, 51, 52, 53, 61, 62, 63, 64],
    // 汎用オーダー
    1018 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 31, 32, 33, 34, 45, 46, 47, 48, 49, 50, 51, 52, 53, 61, 62, 63, 64],
    // 精神
    // 1019 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 31, 32, 33, 34, 41, 42, 43, 44, 51, 52, 53, 61, 62, 63, 64],
    // 放射線
    1020 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 25, 31, 32, 33, 34, 45, 46, 47, 48, 49, 50, 51, 52, 53, 61, 62, 63, 64],
    // リハビリ
    1021 : [11, 12, 13, 14, 15, 21, 22, 23 ,24, 25, 31, 32, 33, 34, 45, 46, 47, 48, 49, 50, 51, 52, 53, 61, 62, 63, 64],
    //訪問診療スケジュール
    1022 : [10, 11, 21, 41],
    //予約カレンダー
    1023 : [10, 11, 21, 41],
    //バイタル
    1024 : [11, 21, 22, 41, 42],
    //カルテ
    1025 : [10, 11, 21],
    // 検査セット
    2016 : [11, 21, 41, 53],
    //透析支援
    3001 : [10, 11, 21, 41, 52],
    // メンテナンスタブ
    8000 : [10],
    // システム設定管理
    8001 : [10, 21],
    // 薬剤マスタ管理
    9001 : [21,53],
    // 検査マスタ管理
    9002 : [21,53],
    //マスタ設定
    9100: [10, 11, 21, 41],
    // お知らせ管理
    9901 : [21],
    9902 : [10],
    1029 : [11, 13, 41, 43, 52], //'入院申込'
    1030 : [11, 13, 41, 43, 52], //'入院決定'
    1031 : [15, 41, 43, 52], //'入院実施'
    1053 : [11, 13, 21, 23], //'入院時指示
    1032 : [11, 13, 41, 43, 52], //'転棟・転室'
    1033 : [11, 13, 41, 43, 52], //'担当変更'
    1034 : [11, 13, 41, 43, 52], //'外泊/帰院'
    1035 : [11, 13, 41, 43, 52], //'退院許可'
    1036 : [11, 13, 41, 43, 52], //'退院決定'
    1037 : [15, 41, 43, 52], //'退院実施'
    1038 : [11, 21, 41],
    1039 : [11, 21, 41],
    1040 : [11, 21, 41],
    1041 : [11, 15, 21, 41],
    1042 : [11, 21, 41],
    1043 : [11, 21, 41, 52],
    1044 : [21, 52],
    1045 : [41, 42, 43, 44], //退院時削除
    1046 : [21, 65], //食事
    1047 : [10, 11], //病棟マップ病床背景
    1048 : [11, 41, 52], //死亡情報
    1049 : [11, 12, 21, 22, 41, 51], //入院看護サマリー
    1050 : [11, 12, 21, 22, 41], //訪問看護サマリー
    1051 : [11, 12, 22], //アナムネ
    1052 : [11, 12, 22], //看護データベース
    1054 : [11, 12, 21, 22, 41, 52], //看護記録
    7022 : [10, 11, 21, 41],        // 単語設定
    7026 : [11], //利用者単語
    7016 : [10, 11, 21, 41],        // 祝日マスタ
    7017 : [10, 11, 21, 41],        // 他施設マスタ
    7021 : [10, 11, 21, 41],        // スタッフ設定
  };

  //透析支援
  let DIAL_FEATURES_AUTHS_MAP = {
    1009 : [21],                    // 個人設定・変更
    3001 : [10, 11, 21, 41, 52],        // 透析支援
    9903 : [10, 11, 21, 41],        // カレンダー
    8000 : [10],                    // メンテナンスタブ
    1028 : [10, 11, 21, 41],        // 透析患者マスタ
    9901 : [21],                    // お知らせ管理
    8001 : [10, 21],                // システム設定管理
    9902 : [10],                    // パスワード
    7001 : [11],                    //機関マスタ
    7002 : [10, 11, 21, 41],        // ベッドマスタ
    7003 : [10, 11, 21, 41],        // コード設定
    7004 : [10, 11, 21, 41],        // 資材マスタ
    7005 : [10, 11, 21, 41],        // 定期検査マスタ
    7006 : [10, 11, 21, 41],        // 薬剤マスタ
    7007 : [10, 11, 21, 41],        // 服用グループマスタ
    7008 : [10, 11, 21, 41],        // 服用マスタ
    7009 : [10, 11, 21, 41],        // 注射マスタ
    7010 : [10, 11, 21, 41],        // 医薬品マスタ
    7011 : [10, 11, 21, 41],        // 検査項目マスタ
    7012 : [10, 11, 21, 41],        // 検査項目パターン
    7013 : [10, 11, 21, 41],        // 合併症検査のパターン
    7014 : [10, 11, 21, 41],        // 病名マスタ
    7015 : [10, 11, 21, 41],        // 管理料マスタ
    7016 : [10, 11, 21, 41],        // 祝日マスタ
    7017 : [10, 11, 21, 41],        // 他施設マスタ
    7018 : [10, 11, 21, 41],        // 処方セットマスタ
    7019 : [10, 11, 21, 41],        // 注射セットマスタ
    7020 : [21],                    // 日本臨床検査マスタ更新
    7021 : [10, 11, 21, 41],        // スタッフ設定
    7022 : [10, 11, 21, 41],        // 単語設定
    7023 : [11, 21, 41],            // Drカルテ
    7024 : [10, 11, 21, 41],        // 画像ジャンルマスタ
    7025 : [10, 21],        // フットケア基本情報設定
    9999 : [80, 81, 82,83,84,85,86,87,88,89,90],  // 経過記録項目設定
  };
  let COMMON_AUTHS_MAP = [
    11, 12, 13, 14, 21, 22, 23 ,24, 31, 32, 33, 34, 41, 42, 43, 44, 51, 52,
  ];
  this.setState({ featureAuths, commonAuths, FEATURES, AUTHS, FEATURES_NAMES, AUTHS_NAMES, FEATURES_AUTHS_MAP,COMMON_AUTHS_MAP, DIAL_FEATURES_AUTHS_MAP});
}
